# First print your name in the cell below then save this file. (or something nice about your instructor)

In [1]:
# In this cell print your name
print("Luiz Felipe Coelho Lemos")

Luiz Felipe Coelho Lemos

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [2]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [3]:
# Load data here
df = pd.read_csv("./data/listings.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46527 entries, 0 to 46526
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              46527 non-null  int64
 1   name                            46509 non-null  object
 2   host_id                         46527 non-null  int64
 3   host_name                       46492 non-null  object
 4   neighbourhood_group             46527 non-null  object
 5   neighbourhood                   46527 non-null  object
 6   latitude                        46527 non-null  float64
 7   longitude                       46527 non-null  float64
 8   room_type                       46527 non-null  object
 9   price                           46527 non-null  int64
 10  minimum_nights                  46527 non-null  int64
 11  number_of_reviews               46527 non-null  int64
 12  last_review                     35816 non-null  object
 13  reviews_per_month               35816 non-null  float64
 14  calculated_host_listings_count  46527 non-null  int64
 15  availability_365                46527 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 5.7+ MB

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [4]:
# 1. How many listings are there with a price less than 100?

lessthan_100 = df[df["price"] < 100]["id"].count()
lessthan_100 # There are 22,778 listing with a price < $100

22778

In [5]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

df_bk = df[df["neighbourhood_group"] == "Brooklyn"]
df_bk["id"].count() # There are 18,632 listings in Brooklyn

18632

In [6]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

df_bk_lt_100 = df_bk[df_bk["price"] < 100]
df_bk_lt_100["id"].count() # There are 10,473 listings in Brooklyn with a price < $100

10473

In [7]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names

df_names = df[df["host_name"].isin(["Michael", "David", "John", "Daniel"])]
df_names["id"].count() # There are 1258 listings where the host names in the list can be found

1258

In [8]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 

df["adjusted_price"] = df.apply(lambda x: x["price"] + 100 if x["neighbourhood"] == "Williamsburg" else x["price"], axis=1)
df[["price", "adjusted_price"]]

       price  adjusted_price
0        175             175
1         75              75
2         60              60
3        175             175
4         65              65
...      ...             ...
46522    145             145
46523     87              87
46524     59              59
46525     80              80
46526     66              66

[46527 rows x 2 columns]

In [9]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
df_room_type = df["room_type"].value_counts()
private_prct = df_room_type["Private room"] / df_room_type.sum()
shared_prct = df_room_type["Shared room"] / df_room_type.sum()

private_prct, shared_prct

(0.45444580566122894, 0.0212134889419047)

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [10]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.
listings_per_neighborhood = df.groupby("neighbourhood_group")["neighbourhood_group"].count()
listings_per_neighborhood

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
Name: neighbourhood_group, dtype: int64

In [11]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups.

avg_price_neighborhood = df[["neighbourhood_group", "price"]].groupby("neighbourhood_group").mean()
avg_price_neighborhood

                          price
neighbourhood_group
Bronx                 92.751479
Brooklyn             120.225258
Manhattan            191.880466
Queens                99.754965
Staten Island        110.947214

In [12]:
# 2.5. Using `groupby`, find the mean price for each room_type. 

avg_price_roomtype = df[["room_type", "price"]].groupby("room_type").mean()
avg_price_roomtype

                      price
room_type
Entire home/apt  199.395950
Hotel room       275.015075
Private room      91.453084
Shared room       87.063830

In [13]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 

minmax_price_neighborhood = df[["neighbourhood_group", "price"]].groupby("neighbourhood_group").agg(
    {"price": ["min", "max"]}
)
minmax_price_neighborhood

                    price
                      min    max
neighbourhood_group
Bronx                  16   1404
Brooklyn                0  10000
Manhattan               0  10000
Queens                  0  10000
Staten Island          19   1200

In [14]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.

df.groupby(["neighbourhood_group", "room_type"])["price"].mean()

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [15]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

df.groupby(["neighbourhood_group", "room_type"])["price"].agg(["count", "min", "max", "mean", "median", "std"])

                                     count  min    max        mean  median  \
neighbourhood_group room_type
Bronx               Entire home/apt    415   25   1404  138.004819   103.0
                    Private room       722   16    700   68.419668    55.0
                    Shared room         46   20    800   66.391304    44.0
Brooklyn            Entire home/apt   9112   20  10000  171.587687   135.0
                    Hotel room          30    0    399  147.300000   129.0
                    Private room      9159   10   2500   71.291189    60.0
                    Shared room        331   15   1500   57.870091    36.0
Manhattan           Entire home/apt  12209    0  10000  231.335572   165.0
                    Hotel room         351    0   2211  292.515670   210.0
                    Private room      7601   10  10000  128.277069    80.0
                    Shared room        419   10  10000  111.735084    60.0
Queens              Entire home/apt   2090   10  10000  150.168900   115.0
                    Hotel room          17    0    249  139.058824   149.0
                    Private room      3499   18   9000   69.972564    55.0
                    Shared room        185   14   3000   89.891892    40.0
Staten Island       Entire home/apt    172   39   1200  151.720930   111.0
                    Private room       163   20    800   70.312883    55.0
                    Shared room          6   19     82   46.000000    38.0

                                            std
neighbourhood_group room_type
Bronx               Entire home/apt  126.032106
                    Private room      57.337866
                    Shared room      114.442703
Brooklyn            Entire home/apt  236.732843
                    Hotel room        91.153206
                    Private room      69.023165
                    Shared room       92.217618
Manhattan           Entire home/apt  410.306439
                    Hotel room       315.924085
                    Private room     448.677306
                    Shared room      502.728868
Queens              Entire home/apt  252.606739
                    Hotel room        50.743806
                    Private room     163.814468
                    Shared room      275.675158
Staten Island       Entire home/apt  147.518392
                    Private room      70.759593
                    Shared room       28.446441

# Join and file saving.
1. Load the `prices.csv` and the `n_listings.csv`


2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']
       
       
3. Save your joined csv as `joined.csv`


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [16]:
# 1. Load the `prices.csv` and the `n_listings.csv`

prices = pd.read_csv("./data/prices.csv")
n_listings = pd.read_csv("./data/n_listings.csv", sep=';')

prices.info(), n_listings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   neighbourhood_group  5 non-null      object
 1    mean_price          5 non-null      float64
dtypes: float64(1), object(1)
memory usage: 208.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   neighbourhood_group  4 non-null      object
 1   n_listings           4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

(None, None)

In [17]:
# 2. Do join that keeps all the records for each table.

joined = pd.merge(prices, n_listings, on="neighbourhood_group", how="outer")
joined.to_csv("./data/joined.csv")
joined_copy = pd.read_csv("./data/joined.csv")
print(joined)
print(joined_copy)

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2           Manhattan   191.880466     20580.0
3              Queens    99.754965         NaN
4       Staten Island   110.947214         NaN
5          LongIsland          NaN      4121.0
   Unnamed: 0 neighbourhood_group   mean_price  n_listings
0           0               Bronx    92.751479      1183.0
1           1            Brooklyn   120.225258     18632.0
2           2           Manhattan   191.880466     20580.0
3           3              Queens    99.754965         NaN
4           4       Staten Island   110.947214         NaN
5           5          LongIsland          NaN      4121.0

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

In [20]:
from pandasai import PandasAI
from pandasai.llm.openai import OpenAI
llm = OpenAI(api_token="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")

In [23]:
pandas_ai = PandasAI(llm, conversational=False) # instantiating AI

C:\Users\lfcle\anaconda3\lib\site-packages\pandasai\__init__.py:145: UserWarning: `PandasAI` (class) is deprecated since v1.0 and will be removed in a future release. Please use `SmartDataframe` instead.
  warnings.warn("`PandasAI` (class) is deprecated since v1.0 and will be removed "

In [26]:
pandas_ai.run(joined, prompt="How many neighbourhood groups are there?") # No money :(

'Unfortunately, I was not able to answer your question, because of the following error:\n\nYou exceeded your current quota, please check your plan and billing details.\n'

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

In [28]:
grammys = pd.read_csv("./data/grammys.csv")
grammys.info()
grammys.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6323 entries, 0 to 6322
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      6323 non-null   int64
 1   category  6323 non-null   object
 2   nominee   6320 non-null   object
 3   workers   5983 non-null   object
 4   winner    6323 non-null   bool
dtypes: bool(1), int64(1), object(3)
memory usage: 203.9+ KB

,year,category,nominee,workers,winner
0,1959,Album of the Year,The Music from Peter Gunn.,Henry Mancini,True
1,1959,Best Album Cover,Only the Lonely,Frank Sinatra (art director),True
2,1959,Best Arrangement,The Music From Peter Gunn,Henry Mancini (artist/arranger),True
3,1959,Best Classical Performance - Chamber Music (in...,Beethoven: Quartet 130,"The Hollywood String Quartet, Paul Shure (arti...",True
4,1959,Best Classical Performance - Instrumentalist (...,Segovia Golden Jubilee,Andrés Segovia,True

In [33]:
# 1. Who won Album of the Year in 2016
aoty_2016 = grammys[
    (grammys['year'] == 2016) &
    (grammys['category'] == 'Album of the Year') &
    (grammys['winner'] == True)][['nominee', 'workers']]
aoty_2016

     nominee                                            workers
5505   1989.  Taylor Swift (artist/producer), Jack Antonoff ...

In [34]:
# 2. Who won Best Rap Album in 2009
bestrap_2009 = grammys[
    (grammys['year'] == 2009) &
    (grammys['category'] == 'Best Rap Album') &
    (grammys['winner'] == True)][['nominee', 'workers']]
bestrap_2009

             nominee     workers
4396  Tha Carter III  Lil' Wayne

In [41]:
# 3. How many awards was Kendrick Lamar nominated for, and how many did he win...?

# First, create a df for all awards Kendrick was nominated for
kendrick_nominated = grammys[grammys['workers'] == 'Kendrick Lamar']

# Second, get summary of nominations using value_counts()
kendrick_nominated_breakdown = kendrick_nominated['winner'].value_counts()

# Third, sum the column to get total nominations
total_nominations = kendrick_nominated_breakdown.sum()

# Finally, select awards where winner == True
awards_won = kendrick_nominated_breakdown[True]

print("Kendrick Lamar has been nominated for {} grammys and won {}!".format(total_nominations, awards_won))

Kendrick Lamar has been nominated for 6 grammys and won 4!

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years and add them all into one data frame using pandas.